&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = "Подтверждение действия";
	Если Параметры.Свойство("ТекстПодтверждения") Тогда
		ТекстПодтверждения = Строка(Параметры.ТекстПодтверждения);
	КонецЕсли;
	Если ПустаяСтрока(СокрЛП(ТекстПодтверждения)) Тогда
		ТекстПодтверждения = "Подтвердите выполнение действий.";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	Закрыть("approve");
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтклонить(Команда)
	Закрыть("reject");
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнятьБезПодтверждения(Команда)
	Закрыть("approve_without_confirmation");
КонецПроцедуры
